Tekla Open API Reference for Tekla Structures 2025
MatrixFactory Methods
The MatrixFactory type exposes the following members.
Methods
Name | Description
ByCoordinateSystems
 Returns a coordinate transformation matrix defined by two coordinate systems. With the returned matrix points can be transformed from the first coordinate system to the second coordinate system. The ByCoordinateSystems method is meant for transforming points between coordinate systems asked in the same work plane.
FromCoordinateSystem
 Returns a coordinate transformation matrix defined by the given coordinate system. With the returned matrix points can be transformed from the given coordinate system to the current work plane coordinate system.
Rotate
 Returns a rotation matrix in a Clockwise rotation around the given rotation axis, defined by the given angle and the given rotation axis.
ToCoordinateSystem
 Returns a coordinate transformation matrix defined by the given coordinate system. With the returned matrix points can be transformed from the current work plane coordinate system to the given coordinate system.
Top
See Also
Reference
MatrixFactory Class
Tekla.Structures.Geometry3d Namespace